package com.nikosval.aepp;

import java.util.Arrays;
import java.util.Collections;
import java.util.Random;

public class QuestionLibraryk4 {

    private String multipleQuestions[] = {
            "Kαθε υποπρόγραμμα πρέπει να είναι _________ απο τα υπόλοιπα.",
            "Σύμφωνα με την τεχνική του ____________ προγραμματισμού ένα πρόγραμμα μπορεί να αναλυθεί σε απλούστερα τμήματα",
            "Η χρήση υποπρογραμμάτων βοηθά στην ______________ του προγράμματος",
            "Η χρήση υποπρογραμμάτων _____________ τις δυαντότητες των γλωσσών προγραμματισμού",
            "Η εντολή αυτή χρησιμοποιείται για την κλήση μιας διαδικασίας",
            "Ποιο είδος υποπρογράμματος πρέπει απαραίτητα να δεχτεί μια ομάδα τιμών (παραμέτρους) για να εκτελεστεί?",
            "Μια διαδικασία μπορει πάντα να μετατραπεί σε συνάρτηση",
            "Δινεται το παρακάτω πρόγραμμα.Τι θα εμφανιστεί? \n ΠΡΟΓΡΑΜΜΑ ΥΠΟΛ \n ΜΕΤΑΒΛΗΤΕΣ \n ΑΚΕΡΑΙΕΣ:Α,Β \n ΑΡΧΗ \n Α=4 \n ΓΙΑ Β ΑΠΟ 1 ΜΕΧΡΙ 3 \n ΚΑΛΕΣΕ ΔΙΑ(Α,Β)\n ΓΡΑΨΕ Α,Β \n Και η διαδικασία: \n ΔΙΑΔΙΚΑΣΙΑ ΔΙΑ(Κ,Λ)\nΜΕΤΑΒΛΗΤΕΣ \nΑΚΕΡΑΙΕΣ:K,Λ,Ξ \n ΑΡΧΗ \n ΓΙΑ Ξ ΑΠΟ 1 ΜΕΧΡΙ Κ \n ΓΡΑΨΕ Λ \n ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ ",
            "Ένα απο τα πλεονεκτήματα του τμηματικού προγραμματισμού είναι:",
            "Ενα υποπρόγραμμα δεν μπορεί να κλήθει πάνω απο μια φορά απο το κύριως πρόγραμμα",
            "Υπάρχει περίπτωση τυπικές και πραγματικές παραμετροι να εχουν το ίδιο όνομα και διαφορετικό τύπο.",
            "Στον κώδικα υλοποιησης μιας συναρτησης ,το ονομα της πρεπει οπωςδηποτε να βρίσκεται τουλαχιστον μια φορα στο αριστερο τμημα της εντολής εκχώρησης",
            "Eπιλέξτε την σωστή δομή για μια συνάρτηση.",
            "Η κλήση των διαδικασιών γίνεται με απλή αναφορά του ονοματός τους.",
            "Κάθε υποπρόγραμμα πρέπει να έχει μόνο μία είσοδο και μία έξοδο",
            " Μια διαδικασία και μια συνάρτηση μπορούν να εκτελούν ακριβώς τις ίδιες λειτουργίες",
             "Ποια είναι η επικεφαλίδα της συνάρτησης Εμβαδόν που υπολογίζει το εμβαδόν ενός τριγώνου",
            "Τι θα τυπώσουν οι παρακάτω εντολές:\n" +
                    "Α <- 5\n" +
                    "Β <- 10\n" +
                    "Γ <- 0\n" +
                    "ΚΑΛΕΣΕ Διαδ1(Α, Β)\n" +
                    "ΓΡΑΨΕ Α, Β, Γ\n" +
                    "...\n" +
                    "ΔΙΑΔΙΚΑΣΙΑ Διαδ1(Γ, Δ)\n" +
                    "...\n" +
                    "ΑΡΧΗ\n" +
                    "Γ <- Γ - Δ\n" +
                    "ΤΕΛΟΣ_ΔΙΑΔΙΑΔΙΚΑΣΙΑΣ Διαδ1",
            "εντολές:\n" +
                    "Α <- 5\n" +
                    "Β <- 10\n" +
                    "ΚΑΛΕΣΕ Διαδ1(Β, Α)\n" +
                    "ΓΡΑΨΕ Α,Β\n" +
                    "...\n" +
                    "ΔΙΑΔΙΚΑΣΙΑ Διαδ1(Γ, Δ)\n" +
                    "...\n" +
                    "ΑΡΧΗ\n" +
                    "ΓΡΑΨΕ Γ, Δ\n" +
                    "Γ <- Γ – Δ\n" +
                    "ΤΕΛΟΣ_ΔΙΑΔΙΑΔΙΚΑΣΙΑΣ Διαδ1",
            "Μια διαδικασία μπορεί να καλέσει το κύριο πρόγραμμα"










    };

    private String manswers[][] = {
            {"Ανεξάρτητο", "Εξαρτημένο",},
            {"Δομημένου", "Τμηματικού","Μαθηματικού"},
            {"Επίλυση", "Υλοποίηση","Κατανόηση"},
            {"Αποδυναμώνει","Επεκτείνει"},
            {"ΓΡΑΨΕ","ΚΑΛΕΣΕ","ΔΙΑΒΑΣΕ"},
            {"Διαδικασία","Συνάρτηση"},
            {"Σωστό","Λάθος"},
            {"1,1,1,1 2,2,2,2 3,3,3,3","1,1,1 2,2,2 3,3,3"},
            {"Eύκολη διόρθωση και κατανόηση προγραμματος", "Ταχύτητα εκτέλεσης", "Και τα 2"},
            {"Σωστό","Λάθος"},
            {"Σωστό","Λάθος"},
            {"Σωστό", "Λάθος",},
            {"Συνάρτηση ονομα(λιστα παραμετρων):τυπος συναρτησης \n Τμημα δηλώσεων \n Αρχή \n \n εντολές \n τελος_συνάρτησης", "Συνάρτηση ονομα(λιστα παραμετρων):Τμημα δηλώσεων \n Λίστα παραμέτρων \n Αρχή \n \n εντολές \n τελος_συνάρτησης"},
            {"Σωστό", "Λάθος",},
            {"Σωστό", "Λάθος",},
            {"Σωστό", "Λάθος",},
            {"ΣΥΝΑΡΤΗΣΗ Εμβαδό(β, υ)","ΣΥΝΑΡΤΗΣΗ Εμβαδό(β,υ):ΠΡΑΓΜΑΤΙΚΗ","ΠΡΑΓΜΑΤΙΚΗ ΣΥΝΑΡΤΗΣΗ Εμβαδό"},
            {"-5,-10,0","10,0,5","-5,10,-5"},
            {"5,10 \n 5,10","10,5 \n 5,5","5,10 \n-5,10"},
            {"Σωστό", "Λάθος",},

















    };

    private String correctanswers[] = {"Ανεξάρτητο", "Τμηματικού", "Κατανόηση","Επεκτείνει","ΚΑΛΕΣΕ","Συνάρτηση","Λάθος","1,1,1,1 2,2,2,2 3,3,3,3","Και τα 2","Λάθος","Λάθος","Λάθος","Συνάρτηση ονομα(λιστα παραμετρων):τυπος συναρτησης \n Τμημα δηλώσεων \n Αρχή \n \n εντολές \n τελος_συνάρτησης","Σωστό","Λάθος","Λάθος","ΣΥΝΑΡΤΗΣΗ Εμβαδό(β,υ):ΠΡΑΓΜΑΤΙΚΗ","-5,-10,0","10,5 \n 5,5","Λάθος"};


    public String getquestion(int a){
        String question=multipleQuestions[a];
        return question;

    }

    public int getanswerslength(int a){
        int answerslength=manswers[a].length;
        return answerslength;

    }


    public String getchoice1(int a){

        String choice0=manswers[a][0];
        return choice0;
    }


    public String getchoice2(int a){

        String choice1=manswers[a][1];
        return choice1;
    }

    public String getchoice3(int a) {

        String choice2 = manswers[a][2];
        return choice2;

    }

    public int getlength(){

        int a=multipleQuestions.length;
        return a;

    }


    public String getCorrectAnswer(int a){

        String answer=correctanswers[a];
        return answer;
    }

    public void suffle(){
        long seed = System.nanoTime();

        Collections.shuffle(Arrays.asList(multipleQuestions),new Random(seed));
        Collections.shuffle(Arrays.asList(manswers),new Random(seed));
        Collections.shuffle(Arrays.asList(correctanswers),new Random(seed));


    }
}
